package com.learning.myproject.enums;

/**
 * @author huoming
 * Email : honghuoming@zhehekeji.com
 * Data : 2019/4/23 0023
 * Time : 11:49
 */
public enum AclEnum {

    ACL1(1,null,"组织架构管理"),

    ACL2(2,ACL1,"组织架构管理"),

    ACL3(3,ACL2,"新增组织"),

    ACL4(4,ACL2,"新建下级组织"),

    ACL5(5,ACL2,"新建平级组织"),

    ACL6(6,ACL2,"编辑组织"),

    ACL7(7,ACL2,"停用/启用组织"),

    ACL8(8,ACL2,"删除组织"),

    ACL9(9,ACL2,"导出Excel"),

    ACL10(10,ACL2,"查看组织详情"),

    ACL11(11,ACL2,"查看组织架构图"),

    ACL12(12,ACL1,"人员管理"),

    ACL13(13,ACL12,"新增人员"),

    ACL14(14,ACL12,"删除人员   "),

    ACL15(15,ACL12,"编辑人员"),

    ACL16(16,ACL12,"禁止登陆"),

    ACL17(17,ACL12,"重置密码"),

    ACL18(18,ACL12,"停用/启用人员"),

    ACL19(19,ACL12,"查看人员"),

    ACL20(20,ACL1,"角色管理"),

    ACL21(21,ACL20,"添加角色"),

    ACL22(22,ACL20,"编辑角色"),

    ACL23(23,ACL20,"删除角色"),

    ACL24(24,ACL20,"查看角色"),

    ACL25(25,null,"业务基础管理"),

    ACL26(26,ACL25,"地区"),

    ACL27(27,ACL26,"新增地区"),

    ACL28(28,ACL26,"新建下级地区"),

    ACL29(29,ACL26,"新建平级地区"),

    ACL30(30,ACL26,"编辑地区"),

    ACL31(31,ACL26,"停用/启用地区"),

    ACL32(32,ACL26,"删除地区"),

    ACL33(33,ACL26,"导出Excel"),

    ACL34(34,ACL26,"查看地区"),

    ACL35(35,ACL25,"仓库管理"),

    ACL36(36,ACL35,"新增仓库"),

    ACL37(37,ACL35,"编辑仓库"),

    ACL38(38,ACL35,"删除仓库"),

    ACL39(39,ACL35,"停用/启用仓库"),

    ACL40(40,ACL35,"导出Excel"),

    ACL41(41,ACL35,"查看仓库"),

    ACL42(42,ACL25,"计量单位管理"),

    ACL43(43,ACL42,"新增计量单位"),

    ACL44(44,ACL43,"编辑计量单位"),

    ACL45(45,ACL44,"删除计量单位"),

    ACL46(46,ACL45,"停用/启用计量单位"),

    ACL47(47,ACL46,"导出Excel"),

    ACL48(48,ACL47,"查看计量单位"),

    ACL49(49,ACL25,"品牌管理"),

    ACL50(50,ACL49,"新增品牌"),

    ACL51(51,ACL49,"编辑品牌"),

    ACL52(52,ACL49,"删除品牌"),

    ACL53(53,ACL49,"停用/启用品牌"),

    ACL54(54,ACL49,"导出Excel"),

    ACL55(55,ACL49,"查看品牌"),

    ACL56(56,ACL25,"品牌分类管理"),

    ACL57(57,ACL56,"新建分类"),

    ACL58(58,ACL56,"新建下级分类"),

    ACL59(59,ACL56,"新建平级分类"),

    ACL60(60,ACL56,"编辑分类"),

    ACL61(61,ACL56,"停用/启用分类"),

    ACL62(62,ACL56,"删除分类"),

    ACL63(63,ACL56,"导出Excel"),

    ACL64(64,ACL56,"查看分类"),

    ACL65(65,ACL25,"结算方式管理"),

    ACL66(66,ACL65,"新增结算方式"),

    ACL67(67,ACL65,"编辑结算方式"),

    ACL68(68,ACL65,"删除结算方式"),

    ACL69(69,ACL65,"停用/启用结算方式"),

    ACL70(70,ACL65,"导出Excel"),

    ACL71(71,ACL65,"查看结算方式"),

    ACL72(72,ACL25,"结算方式分类管理"),

    ACL73(73,ACL72,"新建分类"),

    ACL74(74,ACL72,"新建下级分类"),

    ACL75(75,ACL72,"新建平级分类"),

    ACL76(76,ACL72,"编辑分类"),

    ACL77(77,ACL72,"停用/启用分类"),

    ACL78(78,ACL72,"删除分类"),

    ACL79(79,ACL72,"导出Excel"),

    ACL80(80,ACL72,"查看分类"),

    ACL81(81,ACL25,"商品管理"),

    ACL82(82,ACL81,"新增商品"),

    ACL83(83,ACL81,"编辑商品"),

    ACL84(84,ACL81,"删除商品"),

    ACL85(85,ACL81,"停用/启用商品"),

    ACL86(86,ACL81,"导出Excel"),

    ACL87(87,ACL81,"查看商品"),

    ACL88(88,ACL25,"商品分类管理"),

    ACL89(89,ACL88,"新建分类"),

    ACL90(90,ACL88,"新建下级分类"),

    ACL91(91,ACL88,"新建平级分类"),

    ACL92(92,ACL88,"编辑分类"),

    ACL93(93,ACL88,"停用/启用分类"),

    ACL94(94,ACL88,"删除分类"),

    ACL95(95,ACL88,"导出Excel"),

    ACL96(96,ACL88,"查看分类"),

    ACL97(97,ACL25,"客户职类管理"),

    ACL98(98,ACL97,"新增客户职类"),

    ACL99(99,ACL97,"编辑客户职类"),

    ACL100(100,ACL97,"删除客户职类"),

    ACL101(101,ACL97,"停用/启用客户职类"),

    ACL102(102,ACL97,"导出Excel"),

    ACL103(103,ACL25,"业务类型管理"),

    ACL104(104,ACL103,"新增业务类型"),

    ACL105(105,ACL103,"编辑业务类型"),

    ACL106(106,ACL103,"删除业务类型"),

    ACL107(107,ACL103,"停用/启用业务类型"),

    ACL108(108,ACL103,"导出Excel"),

    ACL109(109,ACL103,"查看业务类型"),

    ACL110(110,ACL25,"业务类型分类管理"),

    ACL111(111,ACL110,"新建分类"),

    ACL112(112,ACL110,"新建下级分类"),

    ACL113(113,ACL110,"新建平级分类"),

    ACL114(114,ACL110,"编辑分类"),

    ACL115(115,ACL110,"停用/启用分类"),

    ACL116(116,ACL110,"删除分类"),

    ACL117(117,ACL110,"导出Excel"),

    ACL118(118,ACL110,"查看分类"),

    ACL119(119,ACL25,"考核科目管理"),

    ACL120(120,ACL119,"新增考核科目"),

    ACL121(121,ACL119,"编辑考核科目"),

    ACL122(122,ACL119,"删除考核科目"),

    ACL123(123,ACL119,"停用/启用考核科目"),

    ACL124(124,ACL119,"导出Excel"),

    ACL125(125,ACL119,"查看考核科目"),

    ACL126(126,ACL25,"往来单位管理"),

    ACL127(127,ACL126,"新增往来单位"),

    ACL128(128,ACL126,"编辑往来单位"),

    ACL129(129,ACL126,"删除往来单位"),

    ACL130(130,ACL126,"停用/启用往来单位"),

    ACL131(131,ACL126,"导出Excel"),

    ACL132(132,ACL126,"查看往来单位"),

    ACL133(133,ACL25,"往来单位分类管理"),

    ACL134(134,ACL133,"新建分类"),

    ACL135(135,ACL133,"新建下级分类"),

    ACL136(136,ACL133,"新建平级分类"),

    ACL137(137,ACL133,"编辑分类"),

    ACL138(138,ACL133,"停用/启用分类"),

    ACL139(139,ACL133,"删除分类"),

    ACL140(140,ACL133,"导出Excel"),

    ACL141(141,ACL133,"查看分类"),

    ACL142(142,ACL133,"查看安装分类"),

    ACL143(143,ACL25,"用工类型管理"),

    ACL144(144,ACL143,"新增用工类型"),

    ACL145(145,ACL143,"编辑用工类型"),

    ACL146(146,ACL143,"删除用工类型"),

    ACL147(147,ACL143,"启用/停用用工类型"),

    ACL148(148,ACL143,"查看用工类型"),

    ACL149(149,ACL143,"导出excel"),

    ACL150(150,ACL25,"信息来源管理"),

    ACL151(151,ACL150,"新增信息来源"),

    ACL152(152,ACL150,"编辑信息来源"),

    ACL153(153,ACL150,"删除信息来源"),

    ACL154(154,ACL150,"停用/启用信息来源"),

    ACL155(155,ACL150,"导出Excel"),

    ACL156(156,ACL25,"房屋类型管理"),

    ACL157(157,ACL156,"新增房屋类型"),

    ACL158(158,ACL156,"编辑房屋类型"),

    ACL159(159,ACL156,"删除房屋类型"),

    ACL160(160,ACL156,"停用/启用房屋类型"),

    ACL161(161,ACL156,"导出Excel"),

    ACL162(162,ACL25,"系统管理"),

    ACL163(163,ACL162,"新增系统"),

    ACL164(164,ACL162,"编辑系统"),

    ACL165(165,ACL162,"删除系统"),

    ACL166(166,ACL162,"停用/启用系统"),

    ACL167(167,ACL162,"导出Excel"),

    ACL168(168,ACL162,"查看系统"),

    ACL169(169,ACL25,"品类管理"),

    ACL170(170,ACL169,"新增品类"),

    ACL171(171,ACL169,"编辑品类"),

    ACL172(172,ACL169,"删除品类"),

    ACL173(173,ACL169,"停用/启用品类"),

    ACL174(174,ACL169,"导出Excel"),

    ACL175(175,ACL169,"查看品类"),

    ACL176(176,ACL25,"品类与商品分类对应表"),

    ACL177(177,ACL176,"新增对应表"),

    ACL178(178,ACL176,"编辑对应表"),

    ACL179(179,ACL176,"删除对应表"),

    ACL180(180,ACL176,"停用/启用对应表"),

    ACL181(181,ACL176,"导出Excel"),

    ACL182(182,null,"客户登记管理"),

    ACL183(183,ACL182,"家用客户"),

    ACL184(184,ACL183,"新增家用客户"),

    ACL185(185,ACL183,"编辑家用客户"),

    ACL186(186,ACL183,"查看家用客户"),

    ACL187(187,ACL183,"查看重复项目"),

    ACL188(188,ACL182,"家用项目限额配置"),

    ACL189(189,ACL188,"编辑限额"),

    ACL190(190,ACL188,"查看限额"),

    ACL191(191,ACL182,"商用客户"),

    ACL192(192,ACL191,"新增商用客户"),

    ACL193(193,ACL191,"编辑商用客户"),

    ACL194(194,ACL191,"查看商用客户"),

    ACL195(195,ACL191,"审核商用客户"),

    ACL196(196,ACL191,"查看重复项目"),

    ACL197(197,ACL182,"分销商列表"),

    ACL198(198,ACL197,"新增分销商"),

    ACL199(199,ACL197,"编辑分销商"),

    ACL200(200,ACL197,"删除分销商"),

    ACL201(201,ACL197,"停用/启用分销商"),

    ACL202(202,ACL197,"导出Excel"),

    ACL203(203,ACL197,"查看分销商详情"),

    ACL204(204,ACL197,"分销商分类管理"),

    ACL205(205,ACL204,"新建分类"),

    ACL206(206,ACL204,"新建下级分类"),

    ACL207(207,ACL204,"新建平级分类"),

    ACL208(208,ACL204,"编辑分类"),

    ACL209(209,ACL204,"停用/启用分类"),

    ACL210(210,ACL204,"删除分类"),

    ACL211(211,ACL204,"导出Excel"),

    ACL212(212,ACL204,"查看分类"),

    ACL213(213,ACL182,"分销商要货申请"),

    ACL214(214,ACL213,"发起要货申请"),

    ACL215(215,ACL213,"查看要货申请"),

    ACL216(216,ACL213,"审核要货申请"),

    ACL217(217,ACL182,"抢单申诉"),

    ACL218(218,ACL217,"发起抢单申诉"),

    ACL219(219,ACL217,"查看抢单申诉"),

    ACL220(220,ACL217,"审核抢单申诉"),

    ACL221(221,ACL182,"协调费"),

    ACL222(222,ACL221,"审核协调费"),

    ACL223(223,ACL221,"查看协调费"),

    ACL224(224,ACL182,"登录系统公告"),

    ACL225(225,ACL224,"发起公告"),

    ACL226(226,ACL224,"查看公告"),

    ACL227(227,ACL224,"提交反馈"),

    ACL228(228,ACL224,"回复反馈"),

    ACL229(229,null,"销售管理"),

    ACL230(230,ACL229,"销售任务"),

    ACL231(231,ACL230,"新增销售任务"),

    ACL232(232,ACL230,"编辑销售任务"),

    ACL233(233,ACL230,"查看销售任务"),

    ACL234(234,ACL230,"导出Excel"),

    ACL235(235,ACL229,"家装模块"),

    ACL236(236,ACL235,"家装跟单"),

    ACL237(237,ACL236,"编辑家装跟单"),

    ACL238(238,ACL236,"合同审批"),

    ACL239(239,ACL236,"特价合同审批"),

    ACL240(240,ACL235,"家装订单"),

    ACL241(241,ACL240,"导出Excel"),

    ACL242(242,ACL235,"家装变更"),

    ACL243(243,ACL242,"新增家装变更"),

    ACL244(244,ACL242,"导出Excel"),

    ACL245(245,ACL235,"家装移交"),

    ACL246(246,ACL245,"新增家装移交"),

    ACL247(247,ACL245,"接收移交"),

    ACL248(248,ACL229,"工装模块"),

    ACL249(249,ACL248,"工装跟单"),

    ACL250(250,ACL249,"编辑工装跟单"),

    ACL251(251,ACL249,"导出Excel"),

    ACL252(252,ACL249,"合同审批"),

    ACL253(253,ACL248,"工装订单"),

    ACL254(254,ACL253,"查看工装订单详情"),

    ACL255(255,ACL253,"导出Excel"),

    ACL256(256,ACL248,"工装变更"),

    ACL257(257,ACL256,"新增工装变更"),

    ACL258(258,ACL256,"导出Excel"),

    ACL259(259,ACL248,"工装移交"),

    ACL260(260,ACL259,"新增工装移交"),

    ACL261(261,ACL259,"接收移交"),

    ACL262(262,ACL259,"导出Excel"),

    ACL263(263,ACL248,"工装实施"),

    ACL264(264,ACL263,"新增工装单"),

    ACL265(265,ACL263,"编辑工装单"),

    ACL266(266,ACL263,"查看工装单详情"),

    ACL267(267,ACL263,"导出Excel"),

    ACL268(268,ACL229,"家装/工装发货"),

    ACL269(269,ACL268,"销售代发货"),

    ACL270(270,ACL269,"查看销售代发货详情"),

    ACL271(271,ACL269,"导出Excel"),

    ACL272(272,ACL268,"销售发货"),

    ACL273(273,ACL272,"新增销售发货"),

    ACL274(274,ACL272,"查看销售发货详情"),

    ACL275(275,ACL272,"导出Excel"),

    ACL276(276,ACL268,"销售退货"),

    ACL277(277,ACL276,"新增销售退货"),

    ACL278(278,ACL276,"查看销售退货详情"),

    ACL279(279,ACL276,"编辑销售退货"),

    ACL280(280,ACL276,"导出Excel"),

    ACL281(281,ACL229,"分销模块"),

    ACL282(282,ACL281,"分销订单"),

    ACL283(283,ACL282,"新增分销订单"),

    ACL284(284,ACL282,"查看分销订单详情"),

    ACL285(285,ACL282,"导出Excel"),

    ACL286(286,ACL281,"分销待发货查询"),

    ACL287(287,ACL286,"查看分销待发货详情"),

    ACL288(288,ACL286,"导出Excel"),

    ACL289(289,ACL281,"分销发货"),

    ACL290(290,ACL289,"新增分销发货"),

    ACL291(291,ACL289,"查看分销发货详情"),

    ACL292(292,ACL289,"导出Excel"),

    ACL293(293,ACL281,"分销退货"),

    ACL294(294,ACL293,"新增分销退货"),

    ACL295(295,ACL293,"查看分销退货详情"),

    ACL296(296,ACL293,"导出Excel"),

    ACL297(297,ACL229,"零散销售"),

    ACL298(298,ACL297,"零售订单"),

    ACL299(299,ACL298,"新增零售订单"),

    ACL300(300,ACL298,"导出Excel"),

    ACL301(301,ACL297,"零售发货"),

    ACL302(302,ACL301,"新增零售发货出库"),

    ACL303(303,ACL301,"导出Excel"),

    ACL304(304,ACL297,"零售退货"),

    ACL305(305,ACL304,"新增零售退货"),

    ACL306(306,ACL304,"导出Excel"),

    ACL307(307,ACL229,"销售开票"),

    ACL308(308,ACL307,"销售开票申请"),

    ACL309(309,ACL308,"新增开票申请"),

    ACL310(310,ACL308,"红冲申请"),

    ACL311(311,ACL308,"导出Excel"),

    ACL312(312,ACL307,"分销开票"),

    ACL313(313,ACL312,"新增分销开票"),

    ACL314(314,ACL312,"导出Excel"),

    ACL315(315,ACL312,"销售模块"),

    ACL316(316,null,"价目表管理"),

    ACL317(317,ACL316,"商品销售采购价格联查"),

    ACL318(318,ACL317,"导出Excel"),

    ACL319(319,ACL307,"销售价格"),

    ACL320(320,ACL316,"商品销售价"),

    ACL321(321,ACL320,"新增商品零售价目表"),

    ACL322(322,ACL320,"查看商品零售价目表详情"),

    ACL323(323,ACL320,"停用商品零售价目表"),

    ACL324(324,ACL320,"商品零售价目表提交审批"),

    ACL325(325,ACL320,"删除商品零售价目表"),

    ACL326(326,ACL320,"导出Excel"),

    ACL327(327,ACL319,"商品销售价格查询"),

    ACL328(328,ACL327,"批量停用商品销售价"),

    ACL329(329,ACL327,"批量启用商品销售价"),

    ACL330(330,ACL327,"导出Excel"),

    ACL331(331,ACL316,"分销价格"),

    ACL332(332,ACL331,"商品分销价"),

    ACL333(333,ACL332,"新增商品分销价目表"),

    ACL334(334,ACL332,"查看商品分销价目表详情"),

    ACL335(335,ACL332,"停用商品分销价目表"),

    ACL336(336,ACL332,"商品分销价目表提交审批"),

    ACL337(337,ACL332,"删除商品分销价目表"),

    ACL338(338,ACL332,"导出Excel"),

    ACL339(339,ACL331,"商品分销价格查询"),

    ACL340(340,ACL339,"批量停用商品分销价"),

    ACL341(341,ACL339,"批量启用商品分销价"),

    ACL342(342,ACL339,"导出Excel"),

    ACL343(343,ACL316,"采购价格"),

    ACL344(344,ACL343,"商品采购价"),

    ACL345(345,ACL344,"新增商品采购价目表"),

    ACL346(346,ACL344,"查看商品采购价目表详情"),

    ACL347(347,ACL344,"停用商品采购价目表"),

    ACL348(348,ACL344,"商品采购价目表提交审批"),

    ACL349(349,ACL344,"删除商品采购价目表"),

    ACL350(350,ACL344,"导出Excel"),

    ACL351(351,ACL343,"商品采购价格查询"),

    ACL352(352,ACL351,"批量停用商品采购价"),

    ACL353(353,ACL351,"批量启用商品采购价"),

    ACL354(354,ACL351,"导出Excel"),

    ACL355(355,ACL316,"物流价格"),

    ACL356(356,ACL355,"物流价目表"),

    ACL357(357,ACL356,"新增物流价目表"),

    ACL358(358,ACL356,"查看物流价目表详情"),

    ACL359(359,ACL356,"停用物流价目表"),

    ACL360(360,ACL356,"物流价目表提交审批"),

    ACL361(361,ACL356,"删除物流价目表"),

    ACL362(362,ACL356,"导出Excel"),

    ACL363(363,ACL355,"商品物流价格查询"),

    ACL364(364,ACL363,"批量停用物流价格"),

    ACL365(365,ACL363,"批量启用物流价格"),

    ACL366(366,ACL363,"导出Excel"),

    ACL367(367,null,"设计师管理"),

    ACL368(368,ACL367,"设计师管理"),

    ACL369(369,ACL368,"新增设计师"),

    ACL370(370,ACL368,"编辑设计师"),

    ACL371(371,ACL368,"启用/停用设计师"),

    ACL372(372,ACL367,"设计师订单分配"),

    ACL373(373,ACL372,"订单分配/重新分配"),

    ACL374(374,ACL367,"设计师权限变更"),

    ACL375(375,ACL355,"设计师任务管理"),

    ACL376(376,ACL375,"编辑设计任务"),

    ACL377(377,ACL375,"设计任务接单"),

    ACL378(378,null,"审批管理"),

    ACL379(379,ACL378,"流程管理"),

    ACL380(380,ACL379,"新建通用审批流程"),

    ACL381(381,ACL379,"编辑通用审批流程"),

    ACL382(382,ACL379,"启用通用审批流程"),

    ACL383(383,ACL379,"停用通用审批流程"),

    ACL384(384,ACL379,"导出Excel"),

    ACL385(385,ACL378,"审批管理"),

    ACL386(386,ACL385,"发起审批"),

    ACL387(387,ACL385,"查看审批详情"),

    ACL388(388,ACL385,"导出Excel"),

    ACL389(389,null,"采购管理"),

    ACL390(390,ACL367,"采购查询"),

    ACL391(391,ACL390,"导出Excel"),

    ACL392(392,ACL389,"采购需求池"),

    ACL393(393,ACL392,"新建采购需求"),

    ACL394(394,ACL392,"导出Excel"),

    ACL395(395,ACL389,"采购单"),

    ACL396(396,ACL395,"新增采购单"),

    ACL397(397,ACL395,"编辑采购单"),

    ACL398(398,ACL395,"查看采购单详情"),

    ACL399(399,ACL395,"导入采购需求"),

    ACL400(400,ACL395,"复核采购单"),

    ACL401(401,ACL395,"反复核采购单"),

    ACL402(402,ACL395,"导出Excel"),

    ACL403(403,ACL389,"采购收货"),

    ACL404(404,ACL403,"新增收货单"),

    ACL405(405,ACL403,"复核收货单"),

    ACL406(406,ACL403,"反复核收货单"),

    ACL407(407,ACL403,"编辑收货单"),

    ACL408(408,ACL403,"删除收货单"),

    ACL409(409,ACL403,"导出Excel"),

    ACL410(410,ACL389,"采购变更"),

    ACL411(411,ACL410,"发起变更"),

    ACL412(412,ACL410,"复核采购变更"),

    ACL413(413,ACL410,"反复核采购变更"),

    ACL414(414,ACL410,"导出Excel"),

    ACL415(415,ACL389,"采购发票管理"),

    ACL416(416,ACL415,"新增发票"),

    ACL417(417,ACL415,"编辑发票"),

    ACL418(418,ACL415,"发票复核"),

    ACL419(419,ACL415,"发票反复核"),

    ACL420(420,ACL415,"导出Excel"),

    ACL421(421,ACL389,"采购退货"),

    ACL422(422,ACL421,"新增退货单"),

    ACL423(423,ACL421,"复核退货单"),

    ACL424(424,ACL421,"反复核退货单"),

    ACL425(425,ACL421,"编辑退货单"),

    ACL426(426,ACL421,"导出Excel"),

    ACL427(427,null,"商品管理"),

    ACL428(428,ACL427,"库存管理"),

    ACL429(429,ACL428,"调拨申请"),

    ACL430(430,ACL429,"新增调拨申请"),

    ACL431(431,ACL429,"编辑调拨申请"),

    ACL432(432,ACL429,"删除调拨申请"),

    ACL433(433,ACL429,"复核"),

    ACL434(434,ACL429,"反复核"),

    ACL435(435,ACL429,"导出Excel"),

    ACL436(436,ACL428,"商品库存管理"),

    ACL437(437,ACL436,"新增盘库"),

    ACL438(438,ACL436,"删除盘库"),

    ACL439(439,ACL436,"复核"),

    ACL440(440,ACL436,"反复核"),

    ACL441(441,ACL436,"锁盘/解锁"),

    ACL442(442,ACL436,"导出Excel"),

    ACL443(443,ACL428,"商品加工（暂时搁置，与拆装关联）"),

    ACL444(444,ACL427,"入库管理"),

    ACL445(445,ACL444,"采购入库"),

    ACL446(446,ACL445,"确认采购入库"),

    ACL447(447,ACL445,"取消确认"),

    ACL448(448,ACL445,"导出Excel"),

    ACL449(449,ACL444,"报溢入库"),

    ACL450(450,ACL449,"新增报溢单"),

    ACL451(451,ACL449,"复核报溢单"),

    ACL452(452,ACL449,"反复核报溢单"),

    ACL453(453,ACL449,"编辑报溢单"),

    ACL454(454,ACL449,"导出Excel"),

    ACL455(455,ACL444,"调拨入库"),

    ACL456(456,ACL455,"编辑调拨入库单"),

    ACL457(457,ACL455,"复核调拨单"),

    ACL458(458,ACL455,"反复核调拨单"),

    ACL459(459,ACL455,"导出Excel"),

    ACL460(460,ACL444,"销售退货入库"),

    ACL461(461,ACL460,"确认入库"),

    ACL462(462,ACL460,"取消确认"),

    ACL463(463,ACL460,"导出Excel"),

    ACL464(464,ACL444,"领用退料入库"),

    ACL465(465,ACL464,"新增领用退货单"),

    ACL466(466,ACL464,"编辑退货单"),

    ACL467(467,ACL464,"复核退货单"),

    ACL468(468,ACL464,"反复核退货单"),

    ACL469(469,ACL464,"删除退货单"),

    ACL470(470,ACL464,"导出Excel"),

    ACL471(471,ACL444,"借用入库（核销）"),

    ACL472(472,ACL471,"确认核销"),

    ACL473(473,ACL471,"取消确认"),

    ACL474(474,ACL471,"导出Excel"),

    ACL475(475,ACL471,"拆装入库（暂时搁置）"),

    ACL476(476,ACL427,"出库管理"),

    ACL477(477,ACL476,"采购退货出库"),

    ACL478(478,ACL477,"新增采购退货"),

    ACL479(479,ACL477,"编辑采购退货"),

    ACL480(480,ACL477,"复核采购退货"),

    ACL481(481,ACL477,"反复核采购退货"),

    ACL482(482,ACL477,"导出Excel"),

    ACL483(483,ACL476,"销售出库"),

    ACL484(484,ACL483,"确认销售出库"),

    ACL485(485,ACL483,"取消确认"),

    ACL486(486,ACL483,"导出Excel"),

    ACL487(487,ACL476,"调拨出库"),

    ACL488(488,ACL487,"编辑调拨出库"),

    ACL489(489,ACL487,"复核调拨出库"),

    ACL490(490,ACL487,"反复核调拨出库"),

    ACL491(491,ACL487,"导出Excel"),

    ACL492(492,ACL476,"领用出库"),

    ACL493(493,ACL492,"新增领用出库"),

    ACL494(494,ACL492,"编辑领用出库"),

    ACL495(495,ACL492,"复核"),

    ACL496(496,ACL492,"反复核"),

    ACL497(497,ACL492,"导出Excel"),

    ACL498(498,ACL476,"借用出库"),

    ACL499(499,ACL498,"发起借用"),

    ACL500(500,ACL498,"编辑借用出库"),

    ACL501(501,ACL498,"复核"),

    ACL502(502,ACL498,"反复核"),

    ACL503(503,ACL498,"删除"),

    ACL504(504,ACL498,"导出Excel"),

    ACL505(505,ACL476,"报损出库"),

    ACL506(506,ACL505,"新增报损单"),

    ACL507(507,ACL505,"编辑报损单"),

    ACL508(508,ACL505,"删除报损单"),

    ACL509(509,ACL505,"导出Excel"),

    ACL510(510,ACL505,"提交审核"),

    ACL511(511,ACL505,"查看流程"),

    ACL512(512,ACL476,"拆装出库（暂时搁置）"),

    ACL513(513,ACL427,"商品汇总查询"),

    ACL514(514,ACL513,"进出汇总查询"),

    ACL515(515,ACL513,"商品收发查询"),

    ACL516(516,ACL513,"库存数量查询"),

    ACL517(517,ACL513,"商品入库查询"),

    ACL518(518,ACL513,"商品出库查询"),

    ACL519(519,ACL513,"报损报溢查询"),

    ACL520(520,null,"往来管理"),

    ACL521(521,ACL520,"销售往来"),

    ACL522(522,ACL521,"销售收款单（家装）"),

    ACL523(523,ACL522,"新增销售收款单"),

    ACL524(524,ACL522,"查看销售收款单详情"),

    ACL525(525,ACL522,"导出Excel"),

    ACL526(526,ACL521,"销售收款单（工装）"),

    ACL527(527,ACL526,"新增销售收款单"),

    ACL528(528,ACL526,"查看销售收款单详情"),

    ACL529(529,ACL526,"导出Excel"),

    ACL530(530,ACL521,"分销收款单"),

    ACL531(531,ACL530,"新增分销收款单"),

    ACL532(532,ACL530,"编辑分销收款单"),

    ACL533(533,ACL530,"导出Excel"),

    ACL534(534,ACL521,"工程付款单"),

    ACL535(535,ACL534,"新增工程付款单"),

    ACL536(536,ACL534,"编辑工程付款单"),

    ACL537(537,ACL534,"导出Excel"),

    ACL538(538,ACL521,"客户欠款&往来表（客户）"),

    ACL539(539,ACL534,"导出Excel"),

    ACL540(540,ACL521,"客户欠款&往来表（分销商）"),

    ACL541(541,ACL540,"导出Excel"),

    ACL542(542,ACL520,"采购往来"),

    ACL543(543,ACL542,"采购付款单"),

    ACL544(544,ACL543,"新增采购付款单"),

    ACL545(545,ACL543,"查看采购付款单详情"),

    ACL546(546,ACL543,"编辑采购付款单"),

    ACL547(547,ACL543,"导出Excel"),

    ACL548(548,ACL542,"采购明细跟踪"),

    ACL549(549,ACL548,"查看采购明细详情"),

    ACL550(550,ACL548,"导出Excel"),

    ACL551(551,ACL542,"往来商对账单"),

    ACL552(552,ACL551,"导出Excel"),

    ACL553(553,ACL520,"现金往来"),

    ACL554(554,ACL553,"其他收款单"),

    ACL555(555,ACL554,"新增其他收款单"),

    ACL556(556,ACL554,"查看其他收款单详情"),

    ACL557(557,ACL554,"编辑其他收款单"),

    ACL558(558,ACL554,"导出Excel"),

    ACL559(559,ACL553,"其他付款单"),

    ACL560(560,ACL559,"新增其他付款单"),

    ACL561(561,ACL559,"查看其他付款单详情"),

    ACL562(562,ACL559,"编辑其他付款单"),

    ACL563(563,ACL559,"导出Excel"),

    ACL564(564,ACL520,"提成模块"),

    ACL565(565,ACL564,"家装提成"),

    ACL566(566,ACL565,"编辑家装提成"),

    ACL567(567,ACL564,"分销提成"),

    ACL568(568,ACL567,"品类经理提成"),

    ACL569(569,ACL568,"编辑品类经理提成"),

    ACL570(570,ACL568,"导出Excel"),

    ACL571(571,ACL567,"渠道经理提成"),

    ACL572(572,ACL571,"编辑渠道经理提成"),

    ACL573(573,ACL571,"导出Excel"),

    ACL574(574,ACL567,"分销商返利表"),

    ACL575(575,ACL564,"设计师提成"),

    ACL576(576,null,"财务管理"),

    ACL577(577,ACL576,"商品出库成本计算"),

    ACL578(578,ACL576,"财务基础数据"),

    ACL579(579,ACL578,"会计科目管理"),

    ACL580(580,ACL579,"新增会计科目"),

    ACL581(581,ACL579,"复制上年会计科目"),

    ACL582(582,ACL579,"编辑会计科目"),

    ACL583(583,ACL579,"停用会计科目"),

    ACL584(584,ACL579,"启用会计科目"),

    ACL585(585,ACL579,"导出Excel"),

    ACL586(586,ACL578,"其他往来"),

    ACL587(587,ACL586,"新增往来"),

    ACL588(588,ACL586,"编辑往来"),

    ACL589(589,ACL586,"停用往来"),

    ACL590(590,ACL586,"启用往来"),

    ACL591(591,ACL586,"导出Excel"),

    ACL592(592,ACL576,"期初"),

    ACL593(593,ACL592,"总账期初"),

    ACL594(594,ACL593,"新增总账期初"),

    ACL595(595,ACL593,"编辑总账期初"),

    ACL596(596,ACL593,"导出Excel"),

    ACL597(597,ACL592,"未完成工程期初"),

    ACL598(598,ACL597,"新增未完成工程期初"),

    ACL599(599,ACL597,"编辑未完成工程期初"),

    ACL600(600,ACL597,"导出Excel"),

    ACL601(601,ACL592,"应收核算期初"),

    ACL602(602,ACL601,"新增应收核算期初"),

    ACL603(603,ACL601,"编辑应收核算期初"),

    ACL604(604,ACL601,"导出Excel"),

    ACL605(605,ACL592,"应付核算期初"),

    ACL606(606,ACL605,"新增应付核算期初"),

    ACL607(607,ACL605,"编辑应付核算期初"),

    ACL608(608,ACL605,"导出Excel"),

    ACL609(609,ACL592,"其他应收账款期初"),

    ACL610(610,ACL609,"新增其他应收账款期初"),

    ACL611(611,ACL609,"编辑其他应收账款期初"),

    ACL612(612,ACL609,"导出Excel"),

    ACL613(613,ACL592,"其他应付账款期初"),

    ACL614(614,ACL613,"新增其他应付账款期初"),

    ACL615(615,ACL613,"编辑其他应付账款期初"),

    ACL616(616,ACL613,"导出Excel"),

    ACL617(617,ACL576,"自动分录"),

    ACL618(618,ACL617,"销售收款记账科目设置"),

    ACL619(619,ACL618,"新增销售收款记账科目"),

    ACL620(620,ACL618,"编辑收款记账科目"),

    ACL621(621,ACL618,"导出Excel"),

    ACL622(622,ACL617,"销售发货记账科目设置"),

    ACL623(623,ACL622,"新增销售发货记账科目"),

    ACL624(624,ACL622,"编辑销售发货记账科目"),

    ACL625(625,ACL622,"导出Excel"),

    ACL626(626,ACL617,"采购付款记账科目设置"),

    ACL627(627,ACL626,"新增采购付款记账科目"),

    ACL628(628,ACL626,"编辑采购付款记账科目"),

    ACL629(629,ACL626,"导出Excel"),

    ACL630(630,ACL617,"领料出库记账科目设置"),

    ACL631(631,ACL630,"新增领料出库记账科目"),

    ACL632(632,ACL630,"编辑领料出库记账科目"),

    ACL633(633,ACL630,"导出Excel"),

    ACL634(634,ACL617,"库存记账科目设置"),

    ACL635(635,ACL634,"新增库存记账科目"),

    ACL636(636,ACL634,"编辑库存记账科目"),

    ACL637(637,ACL634,"导出Excel"),

    ACL638(638,ACL617,"其他付款记账科目设置"),

    ACL639(639,ACL638,"新增其他付款记账科目"),

    ACL640(640,ACL638,"编辑其他付款记账科目"),

    ACL641(641,ACL638,"导出Excel"),

    ACL642(642,ACL617,"其他收款记账科目设置"),

    ACL643(643,ACL642,"新增其他收款记账科目"),

    ACL644(644,ACL642,"编辑其他收款记账科目"),

    ACL645(645,ACL642,"导出Excel"),

    ACL646(646,ACL576,"凭证"),

    ACL647(647,ACL646,"销售记账"),

    ACL648(648,ACL647,"销售收款记账"),

    ACL649(649,ACL648,"导入单据"),

    ACL650(650,ACL648,"生成凭证"),

    ACL651(651,ACL648,"查看销售收款记账详情"),

    ACL652(652,ACL647,"销售发货记账"),

    ACL653(653,ACL652,"导入单据"),

    ACL654(654,ACL652,"生成凭证"),

    ACL655(655,ACL652,"查看销售发货记账详情"),

    ACL656(656,ACL646,"采购记账"),

    ACL657(657,ACL656,"采购付款记账"),

    ACL658(658,ACL657,"导入单据"),

    ACL659(659,ACL657,"生成凭证"),

    ACL660(660,ACL657,"查看采购付款记账详情"),

    ACL661(661,ACL646,"其他记账"),

    ACL662(662,ACL661,"领料退料记账"),

    ACL663(663,ACL662,"生成凭证"),

    ACL664(664,ACL662,"查看领料退料记账详情"),

    ACL665(665,ACL661,"库存调拨记账"),

    ACL666(666,ACL665,"生成凭证"),

    ACL667(667,ACL665,"查看领料退料记账详情"),

    ACL668(668,ACL646,"现金银行"),

    ACL669(669,ACL668,"其他付款记账"),

    ACL670(670,ACL669,"导入单据"),

    ACL671(671,ACL669,"生成凭证"),

    ACL672(672,ACL669,"查看其他付款记账详情"),

    ACL673(673,ACL668,"其他收款记账"),

    ACL674(674,ACL673,"导入单据"),

    ACL675(675,ACL673,"生成凭证"),

    ACL676(676,ACL673,"查看其他收款记账详情"),

    ACL677(677,ACL646,"期末处理"),

    ACL678(678,ACL677,"新增结转"),

    ACL679(679,ACL677,"生成凭证"),

    ACL680(680,ACL677,"查看结转详情"),

    ACL681(681,ACL646,"记账凭证"),

    ACL682(682,ACL681,"查看记账凭证详情"),

    ACL683(683,ACL681,"上传记账凭证详情"),

    ACL684(684,ACL681,"批量上传记账凭证"),

    ACL685(685,ACL681,"打印记账凭证");

    private  Integer code;

    private AclEnum parent;

    private  String name;


    AclEnum(int code, AclEnum parent, String name) {
        this.code = code;
        this.parent=parent;
        this.name = name;
    }

    public String getCode() {
        return Integer.toString(code);
    }

    public String getName() {
        return name;
    }
/*
    public static AclEnum get(String code){
        AclEnum[] values = values();
        for (AclEnum e:values){
            if (e.getCode().equals(code)){
                return e;
            }
        }
        return null;
    }

    public static void main(String[] args) throws Exception {
        List<String> ids = ExcelImportUtils.getDataFromExcel(new FileInputStream("D://Documents/acl.xlsx"), 0);
        List<String> parents = ExcelImportUtils.getDataFromExcel(new FileInputStream("D://Documents/acl.xlsx"), 1);
        List<String> names = ExcelImportUtils.getDataFromExcel(new FileInputStream("D://Documents/acl.xlsx"), 2);
        for(int i=1;i<686;i++){
            System.out.println("ACL"+i+"("+i+","+get(parents.get(i-1))+",\""+names.get(i-1)+"\"),");
            System.out.println();
        }

    }*/
}
